#include<stdio.h>
int main()
{
	int a[4][4] = { {1,2,3,4},{5,6,7,8},{9,10,11,12},{13,14,15,16} };//声明二维数组并初始化
	int i, j, temp;

	int(*p)[4] = a;//声明一个指向长度为4的int数组的指针
	int* q = a[0];

	//进行数组转置操作
	for (i = 0; i < 4; i++) //遍历每一行
	{
		for (j = i + 1; j < 4; j++) //<遍历需要交换的列>
		{
			//进行元素交换
			temp = *(*(p + j) + i);
			*(*(p + j) + i) = *(q + j);
			*(q + j) = temp;
		}

		//<q指向下一行>
		q = q + 4;
	}

	//输出转置后的结果
	for (i = 0; i < 4; i++)
	{
		for (j = 0; j < 4; j++)
		{
			printf("%d ", a[i][j]);
		}

		printf("\n");
	}

	return 0;
}

